Tekla Open API Reference for Tekla Structures 2025
Arc Constructor (Point, Point, Vector, Double)
 Constructs a new arc geometry
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Arc(
	Point centerPoint,
	Point startPoint,
	Vector normal,
	double deltaAngleRadians
)
Public Sub New (
	centerPoint As Point,
	startPoint As Point,
	normal As Vector,
	deltaAngleRadians As Double
)
Parameters
centerPoint
Type: Tekla.Structures.Geometry3d.Point
Center point of the arc.
startPoint
Type: Tekla.Structures.Geometry3d.Point
StartPoint point of the arc.
normal
Type: Tekla.Structures.Geometry3d.Vector
Normal vector of the arc, defines the axis of rotation of the start vector.
deltaAngleRadians
Type: System.Double
Angle of the arc in radians. From 0 to 2*PI.
Exceptions
Exception | Condition
ArgumentException | Throws when input values are not defined correctly
See Also
Reference
Arc Class
Arc Overload
Tekla.Structures.Geometry3d Namespace